# bitwise operator

"""
(7) 10 -> (111) 2
(5) 10 -> (101) 2


Operator

(111)
(101) + 
_____
1100 (Overflow)

# | OR
# & AND
# ^ XOR
# ~ NOT


# MAX

1 | 1 = 1
1 | 0 = 1
0 | 1 = 1
0 | 0 = 0

  111 -> 7
| 101 -> 5
_______
  111 -> 7

# MIN

1 & 1 = 1
1 & 0 = 0
0 & 1 = 0
0 & 0 = 0

  111 -> 7
& 101 -> 5
_______
  101 -> 5

# Diff
تعداد یک ها فرد باشد خروجی یک میشود.

1 ^ 1 = 0
1 ^ 0 = 1
0 ^ 1 = 1
0 ^ 0 = 0

1 ^ 1 ^ 1 = 1
0 ^ 1 ^ 0 = 1
0 ^ 0 ^ 0 = 0

  111 -> 7
^ 101 -> 5
_______
  010 -> 2

"""

a = 5
b = 7

# and or not => logical operator
# & | ^ ~ => bitwise

print(a & b) # and
print(a | b) # or 
print(a ^ b) # xor
print(~a) # not