"""
مدرسه شما در حال برگزاری امتحانات نهایی است. امتحانات شما با محدودیت زمانی همراه است.
لذا به ازای هر ۱ ساعت اضافه که شما در جلسه امتحان وقت بگذارید، یک نمره از شما کسر خواهد شد.

به عناون نمونه زمان امتحان شما ۲ ساعت است. اگر شما در جلسه امتحان ۳ ساعت بشینید در پایان یک نمره از نمره شما کسر خواهد شد.
با توجه به روند طاقت فرسای محاسبه نمرات، مدرسه از شما خواسته است تا برنامه ای بنویسید
 که نمرات داشن آموزان را با توجه به تعداد ساعت حضور آنها در امتحان مجاسبه کیند.

در خط اول ورودی زمان مجاز برای امتحان به شما داده می شود.
سپس در خط بعدی یک عدد به عنوان تعداد دسته‌های متفاوت دانش آموزانی که تاخیر داشتند به شما اعلام می‌شود.
به فرض مقال برای حالت زیر عدد ۳ به شما داده می‌شود:

دانش آموزانی که ۲ ساعت زمان اضافه مصرف کردند.
دانش آموزانی که ۴ ساعت زمان اضافه مصرف کردند.
دانش آموزانی که ۵ ساعت زمان اضافه مصرف کردند.

این عدد تعداد دسته ها را به شما میدهد.
سپس در خط بعدی دو عدد به شما داده میشود که عدد اول تعداد نمرات دانش آموزانی هست که در n خط بعدی به شما داده خواهد شد.
و عدد بعدی مدت زماتی است که دانش آموزان در جلسه امتحان سپری کرده‌اند.

در آخر از شما خواسته شده است تا هر دسته تا به تفکیک چاپ کنید.

نمونه ورودی:
3
2
2 4
18
19
3 5
20
19
15

توضیح:
عدد ۳ در خط اول به معنا مدت زمان قانونی امتحان است
عدد ۲ که در خط بعدی آمده است به معنای تعداد دسته‌های زمانی است.

 یعنی به عنوان نمونه ما در سوال بالا ۲ دسته دانش آموز در لحاط مدت زمان امتخان داریم
این عدد نمایانگر تعداد دوتایی های تعداد نمرات و مدت زمان امتحان است =>

2 4 => افرادی که 4 ساعت مدت زمان امتخان آنها طول کشده است
3 5  => افرادی که 5 ساعت مدت زمان امتخان آنها طول کشیده است.

2 4
بدین معنا است که در دو خط بعدی نمرات دانش آموزانی که ۴ ساعت امتحان آنها طول کشده است به شما داده خواهد شد.
"""
"""
input and output
2
2
2 3
19
20
3 4
13
20
19
time: 3, scores: [18, 19]
time: 4, scores: [11, 18, 17]
"""

exam_legal_duration = int(input())
chunk_of_scores = int(input())

scores_duration = []

for _ in range(chunk_of_scores):
    items = input().split()

    student_scores = []
    num_of_scores = int(items[0])
    exam_duration = int(items[1])

    for _ in range(num_of_scores):
        score = int(input())

        if score > 20 or score < 0:
            print("Wrong input!")
        else:
            student_scores.append(score)

    # حال باید ما نمرات دانش آموزانی که exam_duration تاخیر داشته اند را در یک دوتایی بصورت زیر ذخیره کنیم
    # [exam_duration, student_scores]
    # [2, [20, 19, 16]]
    scores_duration.append([exam_duration, student_scores])

new_scores_list = []
for exam_time, scores in scores_duration:
    new_scores = []

    for score in scores:
        new_score = score - (exam_time - exam_legal_duration)
        new_scores.append(new_score)

    new_scores_list.append([exam_time, new_scores])

for exam_time, scores in new_scores_list:
    print(f"time: {exam_time}, scores: {scores}")
