"""
تمرین اول:

جا به جایی صفر‌ها

برنامه ای بنویسید که تمام صفر‌های یک لیست را به آخر لیست منتقل کند.

در خط اول ورودی، در یک خط به شما دنباله‌ای از اعداد با فاصله ( space ) داده میشود. با استفاده از دستور map تمام اعداد را به int تبدیل کنید. سپس صفر‌های موجود در لیست را به آخر لیست منتقل کنید.

نمونه ورودی:
0 1 0 5 0 1 2

نمونه خروجی:
1 5 1 2 0 0 0
"""

my_list = [0, 1, 0, 5, 0, 1, 2]

for item in my_list:
    if item == 0:
        my_list.remove(item)
        my_list.append(item)

print(my_list)