"""
در خط اول ابتدا تعداد نمرات دانش آ«وزان را از کاربر دریافت کنید.
در n خط بعدی کاربر نمرات دانش آموزان را برای شما وارد میکند.

نمرات را در یک لیست ذخیره سازی کنید و سپس بیشترین نمره را در خروجی چاپ کنید.
"""

n = int(input())
student_scores = []

for _ in range(n):
    score = int(input())

    if score > 20 or score < 0:
        print("Wrong input!")
    else:
        student_scores.append(score)

# ابتدا بیشترین نمره را ۰ در نظر میگیریم.
# ابتدا کمترین نمره را برابر ۲۱ قرار میدهیم. چرا؟
# ابتدا باید مقدار مینیمم را برابر با بیشترین حد در فضای مسئله قرار دهیم
# ( که با توجه به اینکه نمرات بین ۰ تا ۲۰ هستند بیشتری نمره ۲۱ میشود)
# تا بتوانیم نمرات را با مقدار مینیمم اولیه مقابسه کنیم و اگر نمره ای کمتر از مقدار مینیمم فعلی بود
# آن نمره را به عنوان مقدار مینیمم قعلی قرار میدهیم.
#  به این حالت فکر کنید اگر مقدار اولیه مینیمم را کمتر از ۲۱ قرار میدادیم چه اتفاقی رخ میداد.
min_score = 21

# روی تمام نمرات می چرخیم و اگر نمره ای از مینیمم فعلی کمتر بود.
# آن نمره را به عنوان مینیمم فعلی مد نظر قرار میدهیم.
for score in student_scores:
    if score < min_score:
        min_score = score

print(f"min of student's scores is: {min_score}")
